; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-72)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity v5 c2)
    (capacity v6 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l7)
    (at p2 l1)
    (at p3 l2)
    (at p4 l5)
    (at p5 l3)
    (at p6 l10)
    (at p7 l5)
    (at p8 l8)
    (at p9 l5)
    (at p10 l5)
    (at p11 l7)
    (at p12 l6)
    (at v1 l7)
    (at v2 l4)
    (at v3 l8)
    (at v4 l7)
    (at v5 l5)
    (at v6 l12)
    (road l3 l7)
    (road l4 l6)
    (road l12 l13)
    (road l11 l2)
    (road l5 l10)
    (road l13 l2)
    (road l2 l11)
    (road l13 l8)
    (road l7 l13)
    (road l3 l9)
    (road l10 l5)
    (road l13 l4)
    (road l13 l7)
    (road l13 l10)
    (road l1 l8)
    (road l6 l4)
    (road l2 l13)
    (road l7 l3)
    (road l4 l13)
    (road l9 l3)
    (road l8 l1)
    (road l10 l13)
    (road l8 l13)
    (road l13 l12)
    (road l4 l9)
    (road l9 l4)
    (road l11 l12)
    (road l12 l11)
    (road l1 l13)
    (road l13 l1)
    (road l4 l5)
    (road l5 l4)
    (road l1 l3)
    (road l3 l1)
    (road l3 l12)
    (road l12 l3)
    (road l6 l11)
    (road l11 l6)
    (road l2 l8)
    (road l8 l2)
    (road l7 l11)
    (road l11 l7)
    (road l2 l10)
    (road l10 l2)
    (road l2 l6)
    (road l6 l2)
    (road l1 l2)
    (road l2 l1)
    (road l3 l6)
    (road l6 l3)
    (road l6 l10)
    (road l10 l6)
    (road l5 l7)
    (road l7 l5)
    (road l2 l3)
    (road l3 l2)
    (road l9 l10)
    (road l10 l9)
    (road l8 l9)
    (road l9 l8)
    (road l5 l6)
    (road l6 l5)
    )
 (:goal (and 
(at p1 l1)
(at p2 l7)
))
)

; plan
1. (pick-up v4 l7 p1 c1 c2)
   deleted: (at p1 l7) (capacity v4 c2)
   added: (in p1 v4) (capacity v4 c1)
   goals met: 0 of 2
2. (drive v4 l7 l13)
   deleted: (at v4 l7)
   added: (at v4 l13)
   goals met: 0 of 2
3. (drive v4 l13 l1)
   deleted: (at v4 l13)
   added: (at v4 l1)
   goals met: 0 of 2
4. (drop v4 l1 p1 c1 c2)
   deleted: (in p1 v4) (capacity v4 c1)
   added: (at p1 l1) (capacity v4 c2)
   goals met: 1 of 2
5. (pick-up v4 l1 p2 c1 c2)
   deleted: (at p2 l1) (capacity v4 c2)
   added: (in p2 v4) (capacity v4 c1)
   goals met: 1 of 2
6. (drive v4 l1 l13)
   deleted: (at v4 l1)
   added: (at v4 l13)
   goals met: 1 of 2
7. (drive v4 l13 l7)
   deleted: (at v4 l13)
   added: (at v4 l7)
   goals met: 1 of 2
8. (drop v4 l7 p2 c1 c2)
   deleted: (in p2 v4) (capacity v4 c1)
   added: (at p2 l7) (capacity v4 c2)
   goals met: 2 of 2
